# Third-party package repositories
tap "heroku/brew"              # Heroku CLI tools
tap "homebrew/services"        # Manage brew services (start/stop background services)

# Core utilities and dependencies
brew "zstd"                    # Fast compression algorithm
brew "openssl@3"               # SSL/TLS cryptography library
brew "coreutils"               # GNU core utilities (enhanced versions of ls, cp, etc.)
brew "readline"                # Library for command-line editing
brew "libffi"                  # Foreign Function Interface library
brew "shared-mime-info"        # Database of common MIME types
brew "pkgconf"                 # Package compiler and linker metadata toolkit

# Development tools
brew "flyctl"                  # Fly.io deployment CLI
brew "gh"                      # GitHub CLI
brew "git"                     # Version control system
brew "tmux"                    # Terminal multiplexer
brew "tree"                    # Display directories as trees
brew "wget"                    # Internet file retriever
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh
brew "jq"                      # Command-line JSON processor

# Programming languages and environments
brew "nvm"                     # Node Version Manager
brew "ruby-build"              # Ruby version installer
brew "rbenv"                   # Ruby environment manager
brew "pyenv"                   # Python environment manager
brew "pyenv-virtualenv"        # Python virtual environment manager

# Applications (GUI)
cask "finicky"                 # Browser selector
